Revit 2024 API
FabricationNetworkChangeService.SetServiceId Method
 Set the fabrication service identifier to change the elements to.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018.2
Syntax
C#
public void SetServiceId(
	int serviceId
)
Visual Basic
Public Sub SetServiceId ( _
	serviceId As Integer _
)
Visual C++
public:
void SetServiceId(
	int serviceId
)
Parameters
serviceId
Type: System.Int32
See Also
FabricationNetworkChangeService Class
Autodesk.Revit.DB.Fabrication Namespace